"""Создать поверхность. Реализовать отдельный класс Sprite,
в котором в def__init__ будет происходить загрузка изображения
спрайта и создание нужный полей для движения, и с методами
update(для управления персонажа) и draw(для его отрисовки).
Найти в интернете изображение персонажа(или использовать моего),
добавить его на дисплей. Реализовать управление по стрелкам
или кнопкам WASD. Добавить фоновую картинку."""



"""Реализовать доп. класс Item с теми же полями и методами что и 
Sprite.  Найти в интернете изображение доп. спрайта(или использовать 
мое яблоко), добавить его на дисплей. Реализовать бесконечное 
движение спрайта по экрану с отскоком от стен. При соударении 
со стеной, увеличивать его скорость на рандомное значение в 
диапазоне от 1 до 5."""
