"""Создать поверхность. Реализовать класс основного спрайта
наследованного от pg.sprite.Sprite и класс добавочного спрайта
тоже от pg.sprite.Sprite. Добавочный спрайт объединить в группу
из 15ти элементов. В случае если происходит коллизия между
основным спрайтом и группой, уничтожать элемент группы, в
консоль выводить текущий счёт."""



"""Создать поверхность. Реализовать объект класса Rect основного 
квадрата и объекты класса Rect добавочных 15ти квадратов. 
Вывести всё на экран. В случае если происходит коллизия между 
основным квадратом и добавочными, удалить добавочный, а в консоль 
выводить текущий счёт."""
