"""Создать поверхность. Создать пространство, с гравитацией.
Сделать лабиринт из статических линий, для динамического шарика.
Шарик создается в месте, где нажимается левая кнопка мыши.
После лабиринта шарик попадает в корзину, сделанную также из
статических линий. Массу и размер выбрать произвольно."""


"""Создать поверхность. Создать пространство, с гравитацией. 
Сделать 4 двигающихся кинематических платформы из линий. 
Расположить их друг под другом. У каждой платформы своя скорость 
движения, от левого края экрана до правого. Создать динамический 
шарик. Шарик создается в месте, где нажимается левая кнопка мыши. 
Внизу экрана реализовать статическую линию на всю длину дисплея. 
На линии выложить ряд из динамических прямоугольников. Массу и 
размер выбрать произвольно."""
