"""Реализовать меню. Оно должно появляться при старте игры и при
нажатии кнопки escape по время игры. На нём три кнопки:
start(resume),setting,exit. Все три кнопки должны быть кликабельными.
При нажатии на start(resume) запускается игра, при нажатии на
setting появляется меню с настройками, в нём реализовать слайдер
volume и кнопку back для выхода назад в менюшку. При нажатии на
exit в основном меню вы должны выходить из игры."""


"""
Реализовать в окне setting ещё одну кнопку score, при нажатии на 
которое мы попадаем в новое окошко, где написан текущий счёт. 
В этом же окне реализовать кнопку back, для перехода назад.
"""

