"""Добавьте в вашем проекте ночной режим с темным слоем-маской,
который будет показываться при нажатии кнопки n. Добавьте
дополнительный слой-маску с красным слоем-маской, который будет
показываться при нажатии кнопки r."""


"""Ночью реализовать режим погони. Добавить луч света, который 
движется по экрану по определенному алгоритму. В случае коллизии 
между лучом и персонажем, должна звучат музыка погони, луч следовать 
за персонажем, и мигать красные лучи в уголках карты. Счёт при 
этом должен сбрасываться (стать равным нулю), и на весь экран 
выведете надпись "вы арестованы"."""