"""Добавить систему частиц в свой проект. При сборе спрайта,
он должен взрываться(из него должна вылетать) одна частица.
Добавить спрайт об который можно удариться. При коллизии с
ним происходит потеря некоторого количества монет. Потеря
должна сопровождаться вылетом частиц в количестве потерянных
монет. Также при коллизии спрайт уничтожается и проигрывается
звук потери. """


"""
В режиме погони, когда вас нашёл фонарик, сделать так чтобы 
за персонажем вылетала вереница красных частиц. Сделайте их 
выпуск из точки за персонажем. При окончании режима погони, 
частицы должны убираться."""
