"""Создать игру с основным персонажем. Реализовать управление по
клавишам. Добавить в игру дополнительные предметы для сбора.
Реализовать меню старта с кнопками start(запуск игры),
setting(настройка), exit(полный выход). Помимо старта меню
должно вызываться по кнопке escape. Вывести счёт на экран.
Добавить фоновую музыку, клавишу play/pause для неё и звук при
коллизии с доп. спрайтами. Добавить вылет частицы из спрайта,
при сборе, и шипы, при столкновении с которыми из основного
спрайта вылетают 5 доп спрайтов для сбора, и количество очков
уменьшается также на 5."""
